# Задание 1
age = input('введите число:')
sum = int(age)+2
print(sum)